---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunNosing
source: html/7abbe2ac-a699-c962-eede-53a0b82a3ed8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunNosing Property

"Show Run's Nosings"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowRunNosing { get; }
```